; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	image0 - mode
	image1 - mode
	Star2 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	Star4 - direction
	GroundStation0 - direction
	Star1 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 Star4)
	(supports instrument1 image0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star14)
	(supports instrument2 image0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
)
(:goal (and
	(pointing satellite1 GroundStation3)
	(have_image Planet6 image1)
	(have_image Star7 image0)
	(have_image Phenomenon8 image0)
	(have_image Planet9 image1)
	(have_image Phenomenon10 image0)
	(have_image Star11 image1)
	(have_image Star12 image1)
	(have_image Phenomenon13 image0)
	(have_image Star14 image0)
	(have_image Planet15 image1)
	(have_image Phenomenon16 image1)
	(have_image Planet17 image1)
))

)

; plan
1. (turn_to satellite1 groundstation3 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 groundstation3)
   goals met: 1 of 13
2. (turn_to satellite0 star4 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star4)
   goals met: 1 of 13
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 13
4. (calibrate satellite0 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 1 of 13
5. (turn_to satellite0 phenomenon8 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon8)
   goals met: 1 of 13
6. (take_image satellite0 phenomenon8 instrument1 image0)
   added: (have_image phenomenon8 image0)
   goals met: 2 of 13
7. (turn_to satellite0 phenomenon16 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon16)
   goals met: 2 of 13
8. (take_image satellite0 phenomenon16 instrument1 image1)
   added: (have_image phenomenon16 image1)
   goals met: 3 of 13
9. (turn_to satellite0 phenomenon13 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 13
10. (take_image satellite0 phenomenon13 instrument1 image0)
   added: (have_image phenomenon13 image0)
   goals met: 4 of 13
11. (turn_to satellite0 phenomenon10 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon10)
   goals met: 4 of 13
12. (take_image satellite0 phenomenon10 instrument1 image0)
   added: (have_image phenomenon10 image0)
   goals met: 5 of 13
13. (turn_to satellite0 planet15 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet15)
   goals met: 5 of 13
14. (take_image satellite0 planet15 instrument1 image1)
   added: (have_image planet15 image1)
   goals met: 6 of 13
15. (turn_to satellite0 planet17 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet17)
   goals met: 6 of 13
16. (take_image satellite0 planet17 instrument1 image1)
   added: (have_image planet17 image1)
   goals met: 7 of 13
17. (turn_to satellite0 planet6 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 planet6)
   goals met: 7 of 13
18. (take_image satellite0 planet6 instrument1 image1)
   added: (have_image planet6 image1)
   goals met: 8 of 13
19. (turn_to satellite0 planet9 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet9)
   goals met: 8 of 13
20. (take_image satellite0 planet9 instrument1 image1)
   added: (have_image planet9 image1)
   goals met: 9 of 13
21. (turn_to satellite0 star11 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star11)
   goals met: 9 of 13
22. (take_image satellite0 star11 instrument1 image1)
   added: (have_image star11 image1)
   goals met: 10 of 13
23. (turn_to satellite0 star12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star12)
   goals met: 10 of 13
24. (take_image satellite0 star12 instrument1 image1)
   added: (have_image star12 image1)
   goals met: 11 of 13
25. (turn_to satellite0 star14 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star14)
   goals met: 11 of 13
26. (take_image satellite0 star14 instrument1 image0)
   added: (have_image star14 image0)
   goals met: 12 of 13
27. (turn_to satellite0 star7 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star7)
   goals met: 12 of 13
28. (take_image satellite0 star7 instrument1 image0)
   added: (have_image star7 image0)
   goals met: 13 of 13
